---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.Reset
source: html/1f0364dd-b6a7-b501-0d85-eab4d4a3ffc8.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```